{"weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"dtype": "float32", "shape": [32, 64], "name": "dense_15/kernel"}, {"dtype": "float32", "shape": [64], "name": "dense_15/bias"}, {"dtype": "float32", "shape": [64, 128], "name": "dense_16/kernel"}, {"dtype": "float32", "shape": [128], "name": "dense_16/bias"}, {"dtype": "float32", "shape": [128, 256], "name": "dense_17/kernel"}, {"dtype": "float32", "shape": [256], "name": "dense_17/bias"}, {"dtype": "float32", "shape": [256, 512], "name": "dense_18/kernel"}, {"dtype": "float32", "shape": [512], "name": "dense_18/bias"}, {"dtype": "float32", "shape": [512, 784], "name": "dense_19/kernel"}, {"dtype": "float32", "shape": [784], "name": "dense_19/bias"}]}], "modelTopology": {"training_config": {"loss": "binary_crossentropy", "loss_weights": null, "metrics": null, "optimizer_config": {"class_name": "Nadam", "config": {"beta_1": 0.9, "beta_2": 0.999, "name": "Nadam", "decay": 0.004, "epsilon": 1e-07, "learning_rate": 0.001}}, "weighted_metrics": null, "sample_weight_mode": null}, "keras_version": "2.2.4-tf", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"ragged": false, "dtype": "float32", "batch_input_shape": [null, 32], "name": "input_3", "sparse": false}, "name": "input_3"}, {"class_name": "Sequential", "inbound_nodes": [[["input_3", 0, 0, {}]]], "config": {"layers": [{"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_15", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "batch_input_shape": [null, 32], "use_bias": true, "activity_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu_14", "alpha": 0.30000001192092896}}, {"class_name": "Dropout", "config": {"name": "dropout_12", "dtype": "float32", "trainable": true, "rate": 0.5, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_16", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "use_bias": true, "activity_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu_15", "alpha": 0.30000001192092896}}, {"class_name": "Dropout", "config": {"name": "dropout_13", "dtype": "float32", "trainable": true, "rate": 0.5, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_17", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu_16", "alpha": 0.30000001192092896}}, {"class_name": "Dropout", "config": {"name": "dropout_14", "dtype": "float32", "trainable": true, "rate": 0.5, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_18", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "use_bias": true, "activity_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu_17", "alpha": 0.30000001192092896}}, {"class_name": "Dropout", "config": {"name": "dropout_15", "dtype": "float32", "trainable": true, "rate": 0.5, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_19", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 784, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "sigmoid", "trainable": true, "name": "activation_1"}}, {"class_name": "Reshape", "config": {"dtype": "float32", "trainable": true, "name": "reshape_1", "target_shape": [28, 28]}}], "build_input_shape": [null, 32], "name": "sequential_3"}, "name": "sequential_3"}], "output_layers": [["sequential_3", 1, 0]], "name": "model_2", "input_layers": [["input_3", 0, 0]]}}, "backend": "tensorflow"}, "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.6.0", "format": "layers-model"}