{"weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"dtype": "float32", "shape": [784, 512], "name": "dense_10/kernel"}, {"dtype": "float32", "shape": [512], "name": "dense_10/bias"}, {"dtype": "float32", "shape": [512, 256], "name": "dense_11/kernel"}, {"dtype": "float32", "shape": [256], "name": "dense_11/bias"}, {"dtype": "float32", "shape": [256, 128], "name": "dense_12/kernel"}, {"dtype": "float32", "shape": [128], "name": "dense_12/bias"}, {"dtype": "float32", "shape": [128, 64], "name": "dense_13/kernel"}, {"dtype": "float32", "shape": [64], "name": "dense_13/bias"}, {"dtype": "float32", "shape": [64, 32], "name": "dense_14/kernel"}, {"dtype": "float32", "shape": [32], "name": "dense_14/bias"}]}], "modelTopology": {"training_config": {"loss": "binary_crossentropy", "loss_weights": null, "metrics": null, "optimizer_config": {"class_name": "Nadam", "config": {"beta_1": 0.9, "beta_2": 0.999, "name": "Nadam", "decay": 0.004, "epsilon": 1e-07, "learning_rate": 0.001}}, "weighted_metrics": null, "sample_weight_mode": null}, "keras_version": "2.2.4-tf", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"ragged": false, "dtype": "float32", "batch_input_shape": [null, 28, 28], "name": "input_2", "sparse": false}, "name": "input_2"}, {"class_name": "Sequential", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"layers": [{"class_name": "Flatten", "config": {"dtype": "float32", "batch_input_shape": [null, 28, 28], "trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_10", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "use_bias": true, "activity_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu_9", "alpha": 0.30000001192092896}}, {"class_name": "Dropout", "config": {"name": "dropout_8", "dtype": "float32", "trainable": true, "rate": 0.5, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_11", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu_10", "alpha": 0.30000001192092896}}, {"class_name": "Dropout", "config": {"name": "dropout_9", "dtype": "float32", "trainable": true, "rate": 0.5, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_12", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "use_bias": true, "activity_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu_11", "alpha": 0.30000001192092896}}, {"class_name": "Dropout", "config": {"name": "dropout_10", "dtype": "float32", "trainable": true, "rate": 0.5, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_13", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu_12", "alpha": 0.30000001192092896}}, {"class_name": "Dropout", "config": {"name": "dropout_11", "dtype": "float32", "trainable": true, "rate": 0.5, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_14", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 32, "use_bias": true, "activity_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu_13", "alpha": 0.30000001192092896}}], "build_input_shape": [null, 28, 28], "name": "sequential_2"}, "name": "sequential_2"}], "output_layers": [["sequential_2", 1, 0]], "name": "model_1", "input_layers": [["input_2", 0, 0]]}}, "backend": "tensorflow"}, "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.6.0", "format": "layers-model"}